

//==========================================================================
// 根据指定的流水参照对象计算出相对应的流水目标的流水时间
// 注意: 当两边计算时间时, 计算出的时间不是整数时, 会对同步流水完成产生小量误差时间
//==========================================================================
#define SET_STAIR_LAMP_FLOW_TIME_FROM_FLOW_LED	// 根据FlowLED01的长度与流水时间, 计算出StairLamp的流水时间



//==========================================================================
// 流水灯以渐变方式显示, 否则流水显示时直接以设置亮度显示
//==========================================================================
#define STAIR_LAMP_DISP_FOR_PWM
#define FLOW_LED01_DISP_FOR_PWM


//==========================================================================
// 显示数据有变化时,才发送更新的数据, 否则周期性发送数据
//==========================================================================
//#define STAIR_LAMP_DISP_UPDATA_FOR_CHANGE
//#define FLOW_LED01_DISP_UPDATA_FOR_CHANGE


//==========================================================================
// 流水渐变显示处理的状态
//==========================================================================
#if defined(STAIR_LAMP_DISP_FOR_PWM) || defined(FLOW_LED01_DISP_FOR_PWM)
extern uint8_t R_Disp_For_PWM_State[];
#define C_STAIR_LAMP_DISP_FOR_PWM_ON	0x01
#define C_FLOW_LED01_DISP_FOR_PWM_ON	0x02
#endif


//==========================================================================
// 设置GS1903通信数量(注意: 数量设置不能超过400个, 如果要求超过, 必须找程序员)
//==========================================================================
#define N_STAIR_LAMP_GS1903_NUM_MAX		100
#define N_FLOW_LED_GS1903_NUM_MAX		1200


//==========================================================================
// GS1903显示数据临时存储变量
//==========================================================================
extern uint8_t R_StairLamp_Disp_Data[];		// 楼梯灯显示数据影像变量
extern uint8_t R_FlowLED01_Disp_Data[];		// 流水灯01显示数据影像变量


//==========================================================================
// 楼梯灯和流水灯渐变计算最小单位
// 楼梯灯和流水灯的刷新时间 = 20ms
// 楼梯灯刷新增加数量 = 4
// 显示PWM占空比范围：0--255
// 渐变时间 = 255 / 4 * 20ms = 1280ms
// 设置值越小, PWM渐变越好, 渐亮时间越长
//==========================================================================
#define N_STAIR_LAMP_DISP_PWM_STEP		6
#define N_FLOW_LED01_DISP_PWM_STEP		6


//==========================================================================
// 楼梯灯和流水灯刷新显示的数量
//==========================================================================
#define N_STAIR_LAMP_DISP_STEP_NUM		1
#define N_FLOW_LED01_DISP_STEP_NUM		3







//==========================================================================
// FUNCTION: 第一层楼梯灭灯处理服务程序
// INPUT:    NONE
// OUTPUT:   NONE
//==========================================================================
extern void F_FlowOFF_Floor1_Service(void);





