

//==============================================================================================================
//==============================================================================================================
// 备注:
// 1、程序StairLamp输出按3个灯为单位输出显示(输出时,1个GS1903需要发送3次数据)
//==============================================================================================================
//==============================================================================================================


//==========================================================================
// 楼梯灯控制IC GS1903数量设定
//==========================================================================
// 楼梯灯显示数据影像变量
extern uint8_t R_StairLamp_Disp_Data[];


// 楼梯灯显示标志
extern uint8_t R_StairLamp_Disp_Flag;
#define C_STAIR_LAMP_DISP_UPDATE			0x01	// 楼梯灯显示更新(显示数据内容变化时,更新显示)
#define C_STAIR_LAMP_PWM_TIME_UPDATE		0x02	// 楼梯灯渐变显示时间更新(PWM渐变显示处理时, 变化占空比的DUTY值)
#define C_STAIR_LAMP_SEN1_PARA_UPDATE		0x04	// 楼梯灯SEN1参数转移
#define C_STAIR_LAMP_SEN2_PARA_UPDATE		0x08	// 楼梯灯SEN2参数转移
//=====================================
#define Set_StairLamp_Disp_Updata()			R_StairLamp_Disp_Flag |=  C_STAIR_LAMP_DISP_UPDATE;
#define Clr_StairLamp_Disp_Updata()			R_StairLamp_Disp_Flag &= ~C_STAIR_LAMP_DISP_UPDATE;
#define  Be_StairLamp_Disp_Updata()			(R_StairLamp_Disp_Flag & C_STAIR_LAMP_DISP_UPDATE)
//=====================================
#define Set_StairLamp_PWM_Time_Updata()		R_StairLamp_Disp_Flag |=  C_STAIR_LAMP_PWM_TIME_UPDATE;
#define Clr_StairLamp_PWM_Time_Updata()		R_StairLamp_Disp_Flag &= ~C_STAIR_LAMP_PWM_TIME_UPDATE;
#define  Be_StairLamp_PWM_Time_Updata()		(R_StairLamp_Disp_Flag & C_STAIR_LAMP_PWM_TIME_UPDATE)




//==============================================================================================================
//==============================================================================================================
//==============================================================================================================
//==============================================================================================================

//==========================================================================
// FUNCTION: 楼梯灯所有显示一致的数据
// INPUT:    
//			 R_DispNum -- 显示的数量
//			 R_DispDat -- 显示的数据
// OUTPUT:   NONE
//==========================================================================
extern void F_Disp_StairLamp_All(uint16_t R_DispNum, uint8_t R_DispDat);


//==========================================================================
// FUNCTION: PWM占空比的DUTY值更新
// INPUT:    NONE
// OUTPUT:   NONE
//==========================================================================
extern void F_StairLamp_PWM_TimeUpdate(void);


//==========================================================================
// FUNCTION: 更新显示的数据
// INPUT:    NONE
// OUTPUT:   NONE
//==========================================================================
extern void F_Refresh_StairLamp(void);



//==============================================================================================================
//==============================================================================================================
//==============================================================================================================
//==============================================================================================================

// 流水灯位置处理参数
typedef struct
{
	uint8_t  State;
	uint16_t DelayTime;
	uint16_t Cnt;
}STAIR_LAMP_PARA_T;

// 当前流水灯状态
//R_StairLamp_Para_Sen1A.State
#define C_STAIR_LAMP_IDLE	0x00
#define C_STAIR_LAMP_ON		0x01
#define C_STAIR_LAMP_OFF	0x02




// 流水灯处理变量
extern STAIR_LAMP_PARA_T	R_StairLamp_Para_Sen1A;
extern STAIR_LAMP_PARA_T	R_StairLamp_Para_Sen1B;
extern STAIR_LAMP_PARA_T	R_StairLamp_Para_Sen1C;
extern STAIR_LAMP_PARA_T	R_StairLamp_Para_Sen2A;
extern STAIR_LAMP_PARA_T	R_StairLamp_Para_Sen2B;
extern STAIR_LAMP_PARA_T	R_StairLamp_Para_Sen2C;

//==========================================================================
// FUNCTION: 流水灯处理服务程序
// INPUT:    NONE
// OUTPUT:   NONE
//==========================================================================
extern void F_StairLamp_Service(void);


//==========================================================================
// FUNCTION: 重置楼梯灯处理变量
// INPUT:    NONE
// OUTPUT:   NONE
//==========================================================================
extern void F_StairLamp_Init(void);



//==============================================================================================================
//==============================================================================================================
// 演示功能
//==============================================================================================================
//==============================================================================================================


//==========================================================================
// FUNCTION: 楼梯灯测试开始
// INPUT:    NONE
// OUTPUT:   NONE
//==========================================================================
extern void F_StairTest_Start(void);


//==========================================================================
// FUNCTION: 楼梯灯测试停止
// INPUT:    NONE
// OUTPUT:   NONE
//==========================================================================
extern void F_StairTest_Stop(void);
	

//==========================================================================
// FUNCTION: 楼梯灯测试处理服务程序
// INPUT:    NONE
// OUTPUT:   NONE
//==========================================================================
extern void F_StairTest_Service(void);





